# 向量示例：方向和距离
# 单位向量：向量长度为1
# a^ = a / |a|

# 向量相加：a + b = a + b

# 1. 向量点乘：a * b = |a| * |b| * cos(θ) = x1 * x2 + y1 * y2
# 交换律：a * b = b * a
# 结合律：a * (b + c) = a * b + a * c
# 分配率：(k * a) * b = k * (a * b)

# 作用：判断两个向量的方向：
# 相同方向：a * b > 0
# 逆向：a * b < 0

# 2. 向量叉乘：a x b
# 不满足交换律
# a x b = +c
# b x a = -c
# b x c = +a
# c x b = -a
# c x a = +b
# a x c = -b
# a x b = -b x a
# a x a = 0
# 结合律：a x (b + c) = a x b + a x c
# 分配率：a x (k * b) = k * (a x b)

# 作用：判断左右
# a x b > 0：a 在 b 的左边
# a x b < 0：a 在 b 的右边

# 作用：判断一个点是否在三角形内侧


# 矩阵示例
# 单位矩阵：I，对角线为1，其他为0
# 逆矩阵：A^-1
# A^-1 * A = A * A^-1 = I
# (AB)^-1 = B^-1 * A^-1
# 矩阵转置: (AB)^T = B^T * A^T

# 矩阵乘法: (M X N) (N X P) = (M X P)
# 不满足交换律
# 满足结合律
# 满足分配律


# 齐次坐标